Show / Hide Table of Contents
Class CheckResPlate
Check value for Plate
Inheritance
System.Object
CheckResPlate
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Connection
Assembly: IdeaRS.OpenModel.dll
Syntax
[Serializable]
[DataContract]
public class CheckResPlate
Properties
Improve this Doc   View Source
CheckStatus
Status of the Check
Declaration
[DataMember]
public bool CheckStatus { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
Items
In case of presentation of groups plates (uncoiled beams)
Declaration
[DataMember]
public List<int> Items { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<System.Int32>
Improve this Doc   View Source
LoadCaseId
Id of Load Case
Declaration
[DataMember]
public int LoadCaseId { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
MaxStrain
Max Strain
Declaration
[DataMember]
public double MaxStrain { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
MaxStress
Max Stress
Declaration
[DataMember]
public double MaxStress { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Name
Name of Plate
Declaration
[DataMember]
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
 Improve this Doc
 View Source